In [182]:
import pandas as pd
import numpy as np

Pandas Basics

In [183]:
# Series
data = [10, 20, 30, 40]
s = pd.Series(data, index=['a', 'b', 'c', 'd'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [184]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='str')

In [185]:
s.values

array([10, 20, 30, 40])

In [186]:
# DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Salary": [50_000, 60_000, 70_000]
}

df = pd.DataFrame(data)
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [187]:
df.shape

(3, 3)

In [188]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='str')

In [189]:
df.head()

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [190]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      str
 1   Age     3 non-null      int64
 2   Salary  3 non-null      int64
dtypes: int64(2), str(1)
memory usage: 204.0 bytes

In [191]:
df.describe()

        Age   Salary
count   3.0      3.0
mean   30.0  60000.0
std     5.0  10000.0
min    25.0  50000.0
25%    27.5  55000.0
50%    30.0  60000.0
75%    32.5  65000.0
max    35.0  70000.0

Indexiong and Selection

Column selection

In [192]:
df["Name"]

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: str

In [193]:
df[["Name", "Age"]]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

Row selection

In [194]:
df.loc[0]   # by label/index

Name      Alice
Age          25
Salary    50000
Name: 0, dtype: object

In [195]:
df.iloc[0]  # by position

Name      Alice
Age          25
Salary    50000
Name: 0, dtype: object

Conditional selection

In [196]:
df[df["Age"] > 28]

      Name  Age  Salary
1      Bob   30   60000
2  Charlie   35   70000

Adding or Removing Columns

In [197]:
df["Bonus"] = [5000, 6000, 7000]

In [198]:
df.drop("Salary", axis=1, inplace=True)

In [199]:
df

      Name  Age  Bonus
0    Alice   25   5000
1      Bob   30   6000
2  Charlie   35   7000

Handling Missing Data

In [200]:
df.isnull()

    Name    Age  Bonus
0  False  False  False
1  False  False  False
2  False  False  False

In [201]:
df.dropna()

      Name  Age  Bonus
0    Alice   25   5000
1      Bob   30   6000
2  Charlie   35   7000

In [202]:
df.fillna(0)

      Name  Age  Bonus
0    Alice   25   5000
1      Bob   30   6000
2  Charlie   35   7000

Sorting

In [203]:
df.sort_values(by="Age", ascending=False)

      Name  Age  Bonus
2  Charlie   35   7000
1      Bob   30   6000
0    Alice   25   5000

In [204]:
df.sort_index()

      Name  Age  Bonus
0    Alice   25   5000
1      Bob   30   6000
2  Charlie   35   7000

Reading/Writing Files

In [205]:
df = pd.read_csv("../Datum/data.csv")

In [206]:
df

      Name  Age         City  Salary        Date
0     John   25     New York   50000  2026-01-01
1     Jane   30  Los Angeles   65000  2026-02-01
2      Bob   35      Chicago   55000  2026-03-01
3    Alice   28      Houston   52000  2026-04-01
4  Charlie   32      Phoenix   58000  2026-05-01

In [207]:
df.to_csv("../Datum/output.csv", index=False)

In [208]:
df.to_excel("../Datum/output.xlsx", index=False)

Operations

In [209]:
# Arithmetic operations are vectorized
df['Salary'] * 1.1

0    55000.0
1    71500.0
2    60500.0
3    57200.0
4    63800.0
Name: Salary, dtype: float64

In [210]:
# Apply functions
df["Age_plus_5"] = df["Age"].apply(lambda x: x + 5)

In [211]:
df

      Name  Age         City  Salary        Date  Age_plus_5
0     John   25     New York   50000  2026-01-01          30
1     Jane   30  Los Angeles   65000  2026-02-01          35
2      Bob   35      Chicago   55000  2026-03-01          40
3    Alice   28      Houston   52000  2026-04-01          33
4  Charlie   32      Phoenix   58000  2026-05-01          37

In [212]:
# Apply on rows
df["Info"] = df.apply(lambda row: f"{row["Name"]} ({row["Age"]})", axis=1)

In [213]:
df

      Name  Age         City  Salary        Date  Age_plus_5          Info
0     John   25     New York   50000  2026-01-01          30     John (25)
1     Jane   30  Los Angeles   65000  2026-02-01          35     Jane (30)
2      Bob   35      Chicago   55000  2026-03-01          40      Bob (35)
3    Alice   28      Houston   52000  2026-04-01          33    Alice (28)
4  Charlie   32      Phoenix   58000  2026-05-01          37  Charlie (32)

Grouping

In [214]:
data = {
    "Department": ["HR", "IT", "HR", "IT"],
    "Salary": [50_000, 60_000, 55_000, 65_000]
}
df = pd.DataFrame(data)

In [215]:
df.groupby("Department").mean()

             Salary
Department
HR          52500.0
IT          62500.0

Merging and Joining

In [216]:
df1 = pd.DataFrame({"ID": [1, 2], "Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"ID": [1, 2], "Salary": [50_000, 60_000]})

In [217]:
pd.merge(df1, df2, on="ID", how="inner")

   ID   Name  Salary
0   1  Alice   50000
1   2    Bob   60000

Pivot Tables

In [218]:
df.pivot_table(values="Salary", index="Department", aggfunc="mean")

             Salary
Department
HR          52500.0
IT          62500.0

Data and Time

In [219]:
dates = pd.to_datetime(["2026-01-01", "2026-02-01"])
df["Date"] = dates.repeat(2).values
df["Year"] = df["Date"].dt.year
df["Month"] = df["Date"].dt.month

In [220]:
df

  Department  Salary       Date  Year  Month
0         HR   50000 2026-01-01  2026      1
1         IT   60000 2026-01-01  2026      1
2         HR   55000 2026-02-01  2026      2
3         IT   65000 2026-02-01  2026      2

MultiIndex

In [221]:
arrays = [['HR','HR','IT','IT'], [1,2,1,2]]
index = pd.MultiIndex.from_arrays(arrays, names=('Dept','ID'))
df = pd.DataFrame({'Salary':[50000,55000,60000,65000]}, index=index)

In [222]:
df

         Salary
Dept ID
HR   1    50000
     2    55000
IT   1    60000
     2    65000

Window Functions

In [223]:
df["Salary_Rolling"] = df["Salary"].rolling(window=2).mean()
df["Salary_Expanding"] = df["Salary"].expanding().mean()

In [224]:
df

         Salary  Salary_Rolling  Salary_Expanding
Dept ID
HR   1    50000             NaN           50000.0
     2    55000         52500.0           52500.0
IT   1    60000         57500.0           55000.0
     2    65000         62500.0           57500.0

Categorial Data

In [225]:
df = df.reset_index()
df['Dept'] = df['Dept'].astype('category')

df['Dept'].cat.categories
df['Dept'].cat.codes

0    0
1    0
2    1
3    1
dtype: int8

Efficient Memory Usage

In [226]:
df["Salary"] = pd.to_numeric(df["Salary"], downcast="integer")
df

  Dept  ID  Salary  Salary_Rolling  Salary_Expanding
0   HR   1   50000             NaN           50000.0
1   HR   2   55000         52500.0           52500.0
2   IT   1   60000         57500.0           55000.0
3   IT   2   65000         62500.0           57500.0

In [227]:
df["Dept"] = df["Dept"].astype("category")
df

  Dept  ID  Salary  Salary_Rolling  Salary_Expanding
0   HR   1   50000             NaN           50000.0
1   HR   2   55000         52500.0           52500.0
2   IT   1   60000         57500.0           55000.0
3   IT   2   65000         62500.0           57500.0